SjamonDaal/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
#include <Arduino.h>
#include <ArduinoOTA.h>
#if defined(ARDUINO_ARCH_ESP32)
#include <HTTPClient.h>
#include <HTTPUpdate.h>
#include <WiFi.h>
#include <mbedtls/md.h>
// ESP32's global HTTPUpdate instance is lowercase `httpUpdate`, unlike the
// ESP8266 core's `ESPhttpUpdate`; both expose the same API otherwise.
#define FirmwareUpdate httpUpdate
// PN532 gets its own hardware UART on ESP32, leaving UART0/USB (Serial) free
// for SERIAL_DIAGNOSTICS without disconnecting the reader.
#define PN532_SERIAL Serial2
#else
#include <Crypto.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266httpUpdate.h>
#include <ESP8266WiFi.h>
#define FirmwareUpdate ESPhttpUpdate
// ESP8266 has one usable hardware UART, shared with the USB serial monitor;
// SERIAL_DIAGNOSTICS builds require the PN532 TX/RX to be disconnected.
#define PN532_SERIAL Serial
#endif
#include <WebSocketsClient.h>

#include "bridge_config.h"
#include "protocol.h"
#include "secrets.h"

#ifndef SERIAL_DIAGNOSTICS
#define SERIAL_DIAGNOSTICS 0
#endif

WebSocketsClient webSocket;

uint8_t protocolBuffer[PROTOCOL_HEADER_SIZE + MAX_PROTOCOL_PAYLOAD];
uint8_t pn532Ring[PN532_RING_SIZE];
// Keep the large PN532 exchange buffers in static storage. Allocating both
// inside the WebSocket callback can exhaust the ESP8266's callback stack when
// nfcpy performs its 275-byte PN532 line-diagnostic exchange.
uint8_t pn532AckFrame[MAX_PROTOCOL_PAYLOAD];
uint8_t pn532ResponseFrame[MAX_PROTOCOL_PAYLOAD];
size_t ringHead = 0;
size_t ringTail = 0;
bool waitingForPn532Response = false;
bool websocketConnected = false;
bool otaStarted = false;
bool otaInProgress = false;
bool buttonPending = false;
bool buttonRawPressed = false;
bool buttonStablePressed = false;
bool firmwareCheckRequested = false;
bool firmwareFirstCheckCompleted = false;
bool autonomousDiscoveryEnabled = false;
bool discoveryTargetPending = false;
bool discoveryWaitForRemoval = false;
uint8_t discoveryFrame[64];
uint8_t discoveryFrameLength = 0;
uint8_t consecutiveDiscoveryFailures = 0;
uint32_t nextWifiAttemptAt = 0;
uint32_t wifiConnectedAt = 0;
uint32_t wifiReconnectDelayMs = WIFI_RETRY_INTERVAL_MS;
uint32_t wifiDisconnectCount = 0;
uint32_t websocketConnectedAt = 0;
uint32_t websocketDisconnectedAt = 0;
uint32_t lastWifiPathRecoveryAt = 0;
uint32_t websocketReconnectDelayMs = WS_RECONNECT_INTERVAL_MS;
uint32_t accessFeedbackUntil = 0;
uint32_t buttonChangedAt = 0;
uint32_t buttonRequestId = 0;
uint32_t buttonSentAt = 0;
uint32_t nextButtonRequestId = 0x80000000;
uint32_t lastFirmwareCheckAt = 0;
uint32_t nextDiscoveryAt = 0;
uint32_t discoveryTargetPendingAt = 0;
uint32_t discoveryNoTargetSince = 0;
uint32_t nextTargetEventRequestId = 0x90000000;
uint32_t nextReaderStatusRequestId = 0xA0000000;
bool lastAccessGranted = false;
bool wifiStarted = false;
bool wifiWasConnected = false;
String readerId;
String readerToken;
String deviceHostname;

enum class AsyncFramePhase : uint8_t {
  IDLE,
  WAIT_ACK,
  WAIT_RESPONSE,
};

enum class TransceiveStep : uint8_t {
  IDLE,
  READ_REGISTERS,
  WRITE_REGISTERS,
  CONFIGURE_TIMEOUT,
  EXCHANGE,
};

struct AsyncPn532Command {
  bool active = false;
  AsyncFramePhase phase = AsyncFramePhase::IDLE;
  uint8_t command = 0;
  uint8_t syncState = 0;
  size_t frameLength = 0;
  uint16_t responseTimeoutMs = 0;
  uint32_t deadline = 0;
};

AsyncPn532Command asyncPn532;
TransceiveStep transceiveStep = TransceiveStep::IDLE;
uint8_t transceivePayload[250];
uint8_t transceivePayloadLength = 0;
uint16_t transceiveTimeoutMs = 0;
uint32_t transceiveRequestId = 0;

static void setStatusLed(bool on);
static void setNetworkLed(bool on);

static bool ringEmpty() {
  return ringHead == ringTail;
}

static size_t ringNext(size_t position) {
  return (position + 1) % PN532_RING_SIZE;
}

static void ringClear() {
  ringHead = 0;
  ringTail = 0;
}

static bool ringPush(uint8_t value) {
  const size_t next = ringNext(ringHead);
  if (next == ringTail) {
    return false;
  }
  pn532Ring[ringHead] = value;
  ringHead = next;
  return true;
}

static bool ringPop(uint8_t& value) {
  if (ringEmpty()) {
    return false;
  }
  value = pn532Ring[ringTail];
  ringTail = ringNext(ringTail);
  return true;
}

static void drainPn532Uart() {
  while (PN532_SERIAL.available()) {
    const uint8_t value = static_cast<uint8_t>(PN532_SERIAL.read());
    if (waitingForPn532Response) {
      ringPush(value);
    }
  }
}

static void clearPn532Input() {
  ringClear();
  while (PN532_SERIAL.available()) {
    PN532_SERIAL.read();
  }
}

static void cancelAsyncTransceive() {
  asyncPn532.active = false;
  asyncPn532.phase = AsyncFramePhase::IDLE;
  asyncPn532.frameLength = 0;
  asyncPn532.syncState = 0;
  transceiveStep = TransceiveStep::IDLE;
  transceivePayloadLength = 0;
  waitingForPn532Response = false;
}

static void hardwareResetPn532() {
  cancelAsyncTransceive();
  autonomousDiscoveryEnabled = false;
  discoveryTargetPending = false;
  discoveryWaitForRemoval = false;
  consecutiveDiscoveryFailures = 0;
  clearPn532Input();
  digitalWrite(PN532_RESET_PIN, LOW);
  delay(PN532_RESET_ASSERT_MS);
  digitalWrite(PN532_RESET_PIN, HIGH);
  delay(PN532_RESET_BOOT_MS);
  clearPn532Input();
}

static bool readByteUntil(uint8_t& value, uint32_t deadline) {
  while (static_cast<int32_t>(deadline - millis()) > 0) {
    if (ringPop(value)) {
      return true;
    }
    if (PN532_SERIAL.available()) {
      value = static_cast<uint8_t>(PN532_SERIAL.read());
      return true;
    }
    yield();
  }
  return false;
}

static bool readExact(
    uint8_t* destination,
    size_t count,
    size_t& position,
    uint32_t deadline
) {
  while (count--) {
    if (position >= MAX_PROTOCOL_PAYLOAD ||
        !readByteUntil(destination[position], deadline)) {
      return false;
    }
    position++;
    // Long extended frames can otherwise monopolise the ESP8266 cooperative
    // scheduler while bytes are continuously available.
    yield();
  }
  return true;
}

static bool validateNormalFrame(const uint8_t* frame, size_t length) {
  if (length < 8) {
    return false;
  }
  const uint8_t dataLength = frame[3];
  if (static_cast<uint8_t>(dataLength + frame[4]) != 0) {
    return false;
  }
  uint8_t checksum = 0;
  for (size_t i = 5; i < 5 + static_cast<size_t>(dataLength); i++) {
    checksum = static_cast<uint8_t>(checksum + frame[i]);
  }
  checksum = static_cast<uint8_t>(checksum + frame[5 + dataLength]);
  return checksum == 0 && frame[6 + dataLength] == 0;
}

static bool readPn532Frame(
    uint16_t timeoutMs,
    uint8_t* output,
    size_t& outputLength,
    ErrorCode& error
) {
  const uint32_t deadline = millis() + max<uint16_t>(timeoutMs, 50);
  outputLength = 0;

