SjamonDaal/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
  // Find the PN532 00 00 FF start code while tolerating extra zero preamble.
  uint8_t syncState = 0;
  uint8_t value = 0;
  while (static_cast<int32_t>(deadline - millis()) > 0) {
    if (!readByteUntil(value, deadline)) {
      error = ErrorCode::PN532_TIMEOUT;
      return false;
    }
    if (syncState == 0) {
      syncState = value == 0x00 ? 1 : 0;
    } else if (syncState == 1) {
      syncState = value == 0x00 ? 2 : 0;
    } else if (value == 0xFF) {
      output[0] = 0x00;
      output[1] = 0x00;
      output[2] = 0xFF;
      outputLength = 3;
      break;
    } else {
      syncState = value == 0x00 ? 2 : 0;
    }
  }

  if (outputLength == 0 ||
      !readExact(output, 3, outputLength, deadline)) {
    error = ErrorCode::PN532_TIMEOUT;
    return false;
  }

  // ACK: 00 00 FF 00 FF 00
  if (output[3] == 0x00 && output[4] == 0xFF && output[5] == 0x00) {
    return true;
  }

  if (output[3] == 0xFF && output[4] == 0xFF) {
    // Extended frame: the first length byte is already at output[5].
    if (!readExact(output, 3, outputLength, deadline)) {
      error = ErrorCode::PN532_TIMEOUT;
      return false;
    }
    const size_t dataLength =
        (static_cast<size_t>(output[5]) << 8) | output[6];
    if (dataLength + 10 > MAX_PROTOCOL_PAYLOAD) {
      error = ErrorCode::PN532_FRAME_TOO_LARGE;
      return false;
    }
    if (!readExact(output, dataLength + 1, outputLength, deadline)) {
      error = ErrorCode::PN532_TIMEOUT;
      return false;
    }
    return true;
  }

  const size_t dataLength = output[3];
  if (dataLength + 7 > MAX_PROTOCOL_PAYLOAD) {
    error = ErrorCode::PN532_FRAME_TOO_LARGE;
    return false;
  }
  if (!readExact(output, dataLength + 1, outputLength, deadline)) {
    error = ErrorCode::PN532_TIMEOUT;
    return false;
  }
  if (!validateNormalFrame(output, outputLength)) {
    error = ErrorCode::PN532_BAD_FRAME;
    return false;
  }
  return true;
}

static bool executeLocalPn532Command(
    uint8_t command,
    const uint8_t* commandData,
    uint8_t commandDataLength,
    uint16_t responseTimeoutMs,
    uint8_t* responseData,
    size_t& responseDataLength,
    ErrorCode& error
) {
  const uint8_t frameDataLength =
      static_cast<uint8_t>(commandDataLength + 2);
  size_t frameLength = 0;
  protocolBuffer[frameLength++] = 0x00;
  protocolBuffer[frameLength++] = 0x00;
  protocolBuffer[frameLength++] = 0xFF;
  protocolBuffer[frameLength++] = frameDataLength;
  protocolBuffer[frameLength++] =
      static_cast<uint8_t>(0 - frameDataLength);
  protocolBuffer[frameLength++] = 0xD4;
  protocolBuffer[frameLength++] = command;
  uint8_t checksum = static_cast<uint8_t>(0xD4 + command);
  for (uint8_t i = 0; i < commandDataLength; i++) {
    protocolBuffer[frameLength++] = commandData[i];
    checksum = static_cast<uint8_t>(checksum + commandData[i]);
  }
  protocolBuffer[frameLength++] = static_cast<uint8_t>(0 - checksum);
  protocolBuffer[frameLength++] = 0x00;

  clearPn532Input();
  PN532_SERIAL.write(protocolBuffer, frameLength);
  PN532_SERIAL.flush();

  size_t acknowledgementLength = 0;
  if (!readPn532Frame(
          250,
          pn532AckFrame,
          acknowledgementLength,
          error
      )) {
    return false;
  }
  static const uint8_t ACK[] = {0x00, 0x00, 0xFF, 0x00, 0xFF, 0x00};
  if (acknowledgementLength != sizeof(ACK) ||
      memcmp(pn532AckFrame, ACK, sizeof(ACK)) != 0) {
    error = ErrorCode::PN532_BAD_ACK;
    return false;
  }

  waitingForPn532Response = true;
  size_t responseFrameLength = 0;
  const bool received = readPn532Frame(
      responseTimeoutMs,
      pn532ResponseFrame,
      responseFrameLength,
      error
  );
  waitingForPn532Response = false;
  if (!received) {
    clearPn532Input();
    return false;
  }

  // Atomic discovery commands and their responses are always normal frames.
  if (responseFrameLength < 9 ||
      pn532ResponseFrame[0] != 0x00 ||
      pn532ResponseFrame[1] != 0x00 ||
      pn532ResponseFrame[2] != 0xFF) {
    error = ErrorCode::PN532_BAD_FRAME;
    return false;
  }
  const size_t dataLength = pn532ResponseFrame[3];
  if (dataLength < 2 ||
      dataLength + 7 != responseFrameLength ||
      pn532ResponseFrame[5] != 0xD5 ||
      pn532ResponseFrame[6] != static_cast<uint8_t>(command + 1)) {
    error = ErrorCode::PN532_BAD_FRAME;
    return false;
  }
  responseDataLength = dataLength - 2;
  if (responseDataLength > MAX_PROTOCOL_PAYLOAD) {
    error = ErrorCode::PN532_FRAME_TOO_LARGE;
    return false;
  }
  if (responseDataLength > 0) {
    memcpy(responseData, pn532ResponseFrame + 7, responseDataLength);
  }
  return true;
}

static void sendProtocolMessage(
    MessageType type,
    uint32_t requestId,
    uint16_t timeoutMs,
    const uint8_t* payload,
    uint16_t payloadLength
) {
  protocolBuffer[0] = PROTOCOL_MAGIC_0;
  protocolBuffer[1] = PROTOCOL_MAGIC_1;
  protocolBuffer[2] = PROTOCOL_VERSION;
  protocolBuffer[3] = static_cast<uint8_t>(type);
  writeU32(protocolBuffer + 4, requestId);
  writeU16(protocolBuffer + 8, timeoutMs);
  writeU16(protocolBuffer + 10, payloadLength);
  if (payloadLength && payload != nullptr) {
    memcpy(protocolBuffer + PROTOCOL_HEADER_SIZE, payload, payloadLength);
  }
  webSocket.sendBIN(protocolBuffer, PROTOCOL_HEADER_SIZE + payloadLength);
}

static void sendError(uint32_t requestId, ErrorCode error) {
  const uint8_t code = static_cast<uint8_t>(error);
  sendProtocolMessage(
      MessageType::ERROR_RESPONSE, requestId, 0, &code, sizeof(code)
  );
}

static void handleExecute(const ProtocolMessage& message) {
  if (message.payloadLength == 0 || waitingForPn532Response) {
    sendError(message.requestId, ErrorCode::PN532_BUSY);
    return;
  }

  clearPn532Input();
  PN532_SERIAL.write(message.payload, message.payloadLength);
  PN532_SERIAL.flush();

  size_t frameLength = 0;
  ErrorCode error = ErrorCode::PN532_TIMEOUT;
  if (!readPn532Frame(
          message.timeoutMs,
          pn532AckFrame,
          frameLength,
          error
      )) {
    sendError(message.requestId, error);
    return;
  }

  static const uint8_t ACK[] = {0x00, 0x00, 0xFF, 0x00, 0xFF, 0x00};
  if (frameLength != sizeof(ACK) ||
      memcmp(pn532AckFrame, ACK, sizeof(ACK)) != 0) {
    sendError(message.requestId, ErrorCode::PN532_BAD_ACK);
    return;
  }

  // Keep the PN532 acknowledgement and response entirely local. Returning
  // only the ACK would force a second WebSocket request before the response
  // can be consumed, adding a full LAN round trip inside a time-sensitive
  // ISO-DEP session.
  waitingForPn532Response = true;
  size_t responseLength = 0;
  if (!readPn532Frame(
          PN532_LOCAL_RESPONSE_TIMEOUT_MS,
          pn532ResponseFrame,
          responseLength,
          error
      )) {
    waitingForPn532Response = false;
    clearPn532Input();
    sendError(message.requestId, error);
    return;
  }
  waitingForPn532Response = false;

