SjamonDaal/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
  if (frameLength + responseLength > MAX_PROTOCOL_PAYLOAD) {
    sendError(message.requestId, ErrorCode::PN532_FRAME_TOO_LARGE);
    return;
  }
  memcpy(
      pn532AckFrame + frameLength,
      pn532ResponseFrame,
      responseLength
  );
  frameLength += responseLength;
  sendProtocolMessage(
      MessageType::RESPONSE,
      message.requestId,
      0,
      pn532AckFrame,
      static_cast<uint16_t>(frameLength)
  );
}

static void handleReadFrame(const ProtocolMessage& message) {
  // Kept in the protocol enum so older backends fail explicitly after a
  // firmware upgrade. v2 transports receive ACK + response from EXECUTE.
  sendError(message.requestId, ErrorCode::UNSUPPORTED_TYPE);
}

static void handleDiscover(const ProtocolMessage& message) {
  // Payload is one complete Home Key ECP frame including CRC-A. Keeping the
  // entire PN532 sequence here removes six LAN round trips per discovery
  // cycle while authentication remains under controller ownership.
  if (message.payloadLength < 3 || message.payloadLength > 64 ||
      waitingForPn532Response) {
    sendError(
        message.requestId,
        waitingForPn532Response
            ? ErrorCode::PN532_BUSY
            : ErrorCode::BAD_MESSAGE
    );
    return;
  }

  static const uint8_t RF_FIELD_OFF[] = {0x01, 0x02};
  static const uint8_t POLL_TYPE_A[] = {0x01, 0x00};
  static const uint8_t DETECTION_RETRIES[] = {
      0x05, 0xFF, 0x01, 0x00
  };
  static const uint8_t RF_TIMEOUTS[] = {0x02, 0x0A, 0x0B, 0x08};
  static const uint8_t BIT_FRAMING[] = {0x63, 0x3D, 0x00};

  ErrorCode error = ErrorCode::PN532_TIMEOUT;
  size_t responseLength = 0;
  auto execute = [&](
      uint8_t command,
      const uint8_t* data,
      uint8_t dataLength,
      uint16_t timeoutMs = PN532_LOCAL_RESPONSE_TIMEOUT_MS
  ) {
    responseLength = 0;
    return executeLocalPn532Command(
        command,
        data,
        dataLength,
        timeoutMs,
        pn532AckFrame,
        responseLength,
        error
    );
  };
  auto sendTarget = [&]() {
    if (responseLength + 1 > MAX_PROTOCOL_PAYLOAD) {
      sendError(message.requestId, ErrorCode::PN532_FRAME_TOO_LARGE);
      return;
    }
    memmove(pn532AckFrame + 1, pn532AckFrame, responseLength);
    pn532AckFrame[0] = 1;
    sendProtocolMessage(
        MessageType::RESPONSE,
        message.requestId,
        0,
        pn532AckFrame,
        static_cast<uint16_t>(responseLength + 1)
    );
  };

  if (!execute(
          0x32,
          RF_FIELD_OFF,
          sizeof(RF_FIELD_OFF),
          300
      ) ||
      !execute(0x4A, POLL_TYPE_A, sizeof(POLL_TYPE_A), 500)) {
    sendError(message.requestId, error);
    return;
  }
  if (responseLength > 0 && pn532AckFrame[0] > 0) {
    sendTarget();
    return;
  }

  if (!execute(
          0x32,
          DETECTION_RETRIES,
          sizeof(DETECTION_RETRIES),
          300
      ) ||
      !execute(0x32, RF_TIMEOUTS, sizeof(RF_TIMEOUTS), 300) ||
      !execute(0x08, BIT_FRAMING, sizeof(BIT_FRAMING), 300) ||
      !execute(
          0x42,
          message.payload,
          static_cast<uint8_t>(message.payloadLength),
          300
      )) {
    sendError(message.requestId, error);
    return;
  }

  // End the ECP cycle with the field off and return immediately. The phone
  // needs this field-off interval to transition into Home Key mode. Polling
  // again inside this request both removed that interval and could block for
  // another PN532 target-search timeout.
  if (!execute(0x32, RF_FIELD_OFF, sizeof(RF_FIELD_OFF), 300)) {
    sendError(message.requestId, error);
    return;
  }

  const uint8_t noTarget = 0;
  sendProtocolMessage(
      MessageType::RESPONSE,
      message.requestId,
      0,
      &noTarget,
      sizeof(noTarget)
  );
}

static void handleStartDiscovery(const ProtocolMessage& message) {
  if (message.payloadLength < 3 ||
      message.payloadLength > sizeof(discoveryFrame) ||
      waitingForPn532Response) {
    sendError(
        message.requestId,
        waitingForPn532Response
            ? ErrorCode::PN532_BUSY
            : ErrorCode::BAD_MESSAGE
    );
    return;
  }
  memcpy(discoveryFrame, message.payload, message.payloadLength);
  discoveryFrameLength = static_cast<uint8_t>(message.payloadLength);
  autonomousDiscoveryEnabled = true;
  discoveryTargetPending = false;
  discoveryWaitForRemoval = false;
  consecutiveDiscoveryFailures = 0;
  nextDiscoveryAt = millis();
  sendProtocolMessage(
      MessageType::RESPONSE, message.requestId, 0, nullptr, 0
  );
  const uint8_t status[] = {
      static_cast<uint8_t>(ReaderRuntimeState::READY),
      0,
      0,
  };
  sendProtocolMessage(
      MessageType::READER_STATUS,
      nextReaderStatusRequestId++,
      0,
      status,
      sizeof(status)
  );
}

static void handleResumeDiscovery(const ProtocolMessage& message) {
  if (message.payloadLength > 1 ||
      (message.payloadLength == 1 && message.payload[0] > 1) ||
      !autonomousDiscoveryEnabled) {
    sendError(message.requestId, ErrorCode::BAD_MESSAGE);
    return;
  }
  const bool retry = (
      message.payloadLength == 1 && message.payload[0] == 1
  );
  if (retry) {
    static const uint8_t RF_FIELD_OFF[] = {0x01, 0x02};
    ErrorCode error = ErrorCode::PN532_TIMEOUT;
    size_t responseLength = 0;
    if (!executeLocalPn532Command(
            0x32,
            RF_FIELD_OFF,
            sizeof(RF_FIELD_OFF),
            300,
            pn532AckFrame,
            responseLength,
            error
        )) {
      sendError(message.requestId, error);
      return;
    }
  }
  discoveryTargetPending = false;
  discoveryWaitForRemoval = !retry;
  discoveryNoTargetSince = 0;
  consecutiveDiscoveryFailures = 0;
  nextDiscoveryAt = millis() + (
      retry ? DISCOVERY_RETRY_DELAY_MS : DISCOVERY_INTERVAL_MS
  );
  sendProtocolMessage(
      MessageType::RESPONSE, message.requestId, 0, nullptr, 0
  );
}

enum class AsyncCommandResult : uint8_t {
  PENDING,
  COMPLETE,
  FAILED,
};

static void resetAsyncFrameCollector() {
  asyncPn532.frameLength = 0;
  asyncPn532.syncState = 0;
}

