SjamonDaal/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
static AsyncCommandResult collectAsyncPn532Frame(ErrorCode& error) {
  uint8_t value = 0;
  while (ringPop(value)) {
    if (asyncPn532.frameLength == 0) {
      if (asyncPn532.syncState == 0) {
        asyncPn532.syncState = value == 0x00 ? 1 : 0;
      } else if (asyncPn532.syncState == 1) {
        asyncPn532.syncState = value == 0x00 ? 2 : 0;
      } else if (value == 0xFF) {
        pn532ResponseFrame[0] = 0x00;
        pn532ResponseFrame[1] = 0x00;
        pn532ResponseFrame[2] = 0xFF;
        asyncPn532.frameLength = 3;
      } else {
        asyncPn532.syncState = value == 0x00 ? 2 : 0;
      }
      continue;
    }

    if (asyncPn532.frameLength >= MAX_PROTOCOL_PAYLOAD) {
      error = ErrorCode::PN532_FRAME_TOO_LARGE;
      return AsyncCommandResult::FAILED;
    }
    pn532ResponseFrame[asyncPn532.frameLength++] = value;

    if (asyncPn532.frameLength == 6 &&
        pn532ResponseFrame[3] == 0x00 &&
        pn532ResponseFrame[4] == 0xFF &&
        pn532ResponseFrame[5] == 0x00) {
      return AsyncCommandResult::COMPLETE;
    }

    size_t expectedLength = 0;
    if (asyncPn532.frameLength >= 5 &&
        !(pn532ResponseFrame[3] == 0xFF &&
          pn532ResponseFrame[4] == 0xFF)) {
      expectedLength =
          static_cast<size_t>(pn532ResponseFrame[3]) + 7;
    } else if (asyncPn532.frameLength >= 7) {
      const size_t dataLength =
          (static_cast<size_t>(pn532ResponseFrame[5]) << 8) |
          pn532ResponseFrame[6];
      expectedLength = dataLength + 10;
    }

    if (expectedLength > MAX_PROTOCOL_PAYLOAD) {
      error = ErrorCode::PN532_FRAME_TOO_LARGE;
      return AsyncCommandResult::FAILED;
    }
    if (expectedLength != 0 &&
        asyncPn532.frameLength == expectedLength) {
      return AsyncCommandResult::COMPLETE;
    }
  }

  if (static_cast<int32_t>(millis() - asyncPn532.deadline) >= 0) {
    error = ErrorCode::PN532_TIMEOUT;
    return AsyncCommandResult::FAILED;
  }
  return AsyncCommandResult::PENDING;
}

static bool beginAsyncPn532Command(
    uint8_t command,
    const uint8_t* commandData,
    uint8_t commandDataLength,
    uint16_t responseTimeoutMs
) {
  if (asyncPn532.active) {
    return false;
  }

  const uint8_t frameDataLength =
      static_cast<uint8_t>(commandDataLength + 2);
  size_t frameLength = 0;
  protocolBuffer[frameLength++] = 0x00;
  protocolBuffer[frameLength++] = 0x00;
  protocolBuffer[frameLength++] = 0xFF;
  protocolBuffer[frameLength++] = frameDataLength;
  protocolBuffer[frameLength++] =
      static_cast<uint8_t>(0 - frameDataLength);
  protocolBuffer[frameLength++] = 0xD4;
  protocolBuffer[frameLength++] = command;
  uint8_t checksum = static_cast<uint8_t>(0xD4 + command);
  for (uint8_t i = 0; i < commandDataLength; i++) {
    protocolBuffer[frameLength++] = commandData[i];
    checksum = static_cast<uint8_t>(checksum + commandData[i]);
  }
  protocolBuffer[frameLength++] = static_cast<uint8_t>(0 - checksum);
  protocolBuffer[frameLength++] = 0x00;

  clearPn532Input();
  waitingForPn532Response = true;
  asyncPn532.active = true;
  asyncPn532.phase = AsyncFramePhase::WAIT_ACK;
  asyncPn532.command = command;
  asyncPn532.responseTimeoutMs =
      max<uint16_t>(responseTimeoutMs, 50);
  asyncPn532.deadline = millis() + 250;
  resetAsyncFrameCollector();
  PN532_SERIAL.write(protocolBuffer, frameLength);
  PN532_SERIAL.flush();
  return true;
}

static AsyncCommandResult pollAsyncPn532Command(
    size_t& responseLength,
    ErrorCode& error
) {
  responseLength = 0;
  if (!asyncPn532.active) {
    error = ErrorCode::PN532_BAD_FRAME;
    return AsyncCommandResult::FAILED;
  }

  const AsyncCommandResult frameResult =
      collectAsyncPn532Frame(error);
  if (frameResult != AsyncCommandResult::COMPLETE) {
    if (frameResult == AsyncCommandResult::FAILED) {
      // PN532 ACK also aborts a command still waiting inside the chip.
      static const uint8_t ACK[] = {
          0x00, 0x00, 0xFF, 0x00, 0xFF, 0x00
      };
      PN532_SERIAL.write(ACK, sizeof(ACK));
      PN532_SERIAL.flush();
      asyncPn532.active = false;
      clearPn532Input();
    }
    return frameResult;
  }

  if (asyncPn532.phase == AsyncFramePhase::WAIT_ACK) {
    static const uint8_t ACK[] = {
        0x00, 0x00, 0xFF, 0x00, 0xFF, 0x00
    };
    if (asyncPn532.frameLength != sizeof(ACK) ||
        memcmp(pn532ResponseFrame, ACK, sizeof(ACK)) != 0) {
      error = ErrorCode::PN532_BAD_ACK;
      asyncPn532.active = false;
      return AsyncCommandResult::FAILED;
    }
    asyncPn532.phase = AsyncFramePhase::WAIT_RESPONSE;
    asyncPn532.deadline =
        millis() + asyncPn532.responseTimeoutMs;
    resetAsyncFrameCollector();
    return AsyncCommandResult::PENDING;
  }

  if (!validateNormalFrame(
          pn532ResponseFrame, asyncPn532.frameLength
      ) ||
      asyncPn532.frameLength < 9) {
    error = ErrorCode::PN532_BAD_FRAME;
    asyncPn532.active = false;
    return AsyncCommandResult::FAILED;
  }
  const size_t dataLength = pn532ResponseFrame[3];
  if (dataLength < 2 ||
      dataLength + 7 != asyncPn532.frameLength ||
      pn532ResponseFrame[5] != 0xD5 ||
      pn532ResponseFrame[6] !=
          static_cast<uint8_t>(asyncPn532.command + 1)) {
    error = ErrorCode::PN532_BAD_FRAME;
    asyncPn532.active = false;
    return AsyncCommandResult::FAILED;
  }

  responseLength = dataLength - 2;
  if (responseLength > MAX_PROTOCOL_PAYLOAD) {
    error = ErrorCode::PN532_FRAME_TOO_LARGE;
    asyncPn532.active = false;
    return AsyncCommandResult::FAILED;
  }
  if (responseLength > 0) {
    memcpy(
        pn532AckFrame, pn532ResponseFrame + 7, responseLength
    );
  }
  asyncPn532.active = false;
  return AsyncCommandResult::COMPLETE;
}

static void finishAsyncTransceive(ErrorCode error, bool success) {
  const uint32_t requestId = transceiveRequestId;
  cancelAsyncTransceive();
  clearPn532Input();
  if (!success) {
    sendError(requestId, error);
  }
}

static void handleTransceive(const ProtocolMessage& message) {
  if (message.payloadLength == 0 || message.payloadLength > 250 ||
      message.timeoutMs == 0 ||
      waitingForPn532Response || !discoveryTargetPending) {
    sendError(
        message.requestId,
        waitingForPn532Response
            ? ErrorCode::PN532_BUSY
            : ErrorCode::BAD_MESSAGE
    );
    return;
  }

  memcpy(
      transceivePayload, message.payload, message.payloadLength
  );
  transceivePayloadLength =
      static_cast<uint8_t>(message.payloadLength);
  transceiveTimeoutMs = message.timeoutMs;
  transceiveRequestId = message.requestId;
  transceiveStep = TransceiveStep::READ_REGISTERS;

  static const uint8_t READ_RF_REGISTERS[] = {
      0x63, 0x02, 0x63, 0x03, 0x63, 0x05
  };
  if (!beginAsyncPn532Command(
          0x06,
          READ_RF_REGISTERS,
          sizeof(READ_RF_REGISTERS),
          300
      )) {
    finishAsyncTransceive(ErrorCode::PN532_BUSY, false);
  }
}

