SjamonDaal/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
static void updateAsyncTransceive() {
  if (transceiveStep == TransceiveStep::IDLE) {
    return;
  }

  size_t responseLength = 0;
  ErrorCode error = ErrorCode::PN532_TIMEOUT;
  const AsyncCommandResult result =
      pollAsyncPn532Command(responseLength, error);
  if (result == AsyncCommandResult::PENDING) {
    return;
  }
  if (result == AsyncCommandResult::FAILED) {
    finishAsyncTransceive(error, false);
    return;
  }

  if (transceiveStep == TransceiveStep::READ_REGISTERS) {
    if (responseLength != 3) {
      finishAsyncTransceive(ErrorCode::PN532_BAD_FRAME, false);
      return;
    }
    const uint8_t writeRfRegisters[] = {
        0x63, 0x02, static_cast<uint8_t>(pn532AckFrame[0] & 0x8C),
        0x63, 0x03, static_cast<uint8_t>(pn532AckFrame[1] & 0x8C),
        0x63, 0x05,
        static_cast<uint8_t>((pn532AckFrame[2] & 0xBF) | 0x40),
    };
    transceiveStep = TransceiveStep::WRITE_REGISTERS;
    if (!beginAsyncPn532Command(
            0x08,
            writeRfRegisters,
            sizeof(writeRfRegisters),
            300
        )) {
      finishAsyncTransceive(ErrorCode::PN532_BUSY, false);
    }
    return;
  }

  if (transceiveStep == TransceiveStep::WRITE_REGISTERS) {
    const uint32_t timeoutMicroseconds =
        static_cast<uint32_t>(transceiveTimeoutMs) * 1000UL;
    uint8_t timeoutIndex = 16;
    for (uint8_t index = 0; index < 16; index++) {
      if ((timeoutMicroseconds >> index) <= 100) {
        timeoutIndex = index + 1;
        break;
      }
    }
    const uint8_t rfTimeouts[] = {
        0x02, 0x0A, 0x0B, timeoutIndex
    };
    transceiveStep = TransceiveStep::CONFIGURE_TIMEOUT;
    if (!beginAsyncPn532Command(
            0x32, rfTimeouts, sizeof(rfTimeouts), 300
        )) {
      finishAsyncTransceive(ErrorCode::PN532_BUSY, false);
    }
    return;
  }

  if (transceiveStep == TransceiveStep::CONFIGURE_TIMEOUT) {
    const uint16_t localTimeout = static_cast<uint16_t>(
        min<uint32_t>(
            static_cast<uint32_t>(transceiveTimeoutMs) + 150UL,
            0xFFFFUL
        )
    );
    transceiveStep = TransceiveStep::EXCHANGE;
    if (!beginAsyncPn532Command(
            0x42,
            transceivePayload,
            transceivePayloadLength,
            localTimeout
        )) {
      finishAsyncTransceive(ErrorCode::PN532_BUSY, false);
    }
    return;
  }

  if (responseLength == 0) {
    finishAsyncTransceive(ErrorCode::PN532_BAD_FRAME, false);
    return;
  }
  const uint32_t requestId = transceiveRequestId;
  cancelAsyncTransceive();
  // InCommunicateThru returns status followed by RF response data.
  sendProtocolMessage(
      MessageType::RESPONSE,
      requestId,
      0,
      pn532AckFrame,
      static_cast<uint16_t>(responseLength)
  );
}

static void autonomousDiscoveryFailure(ErrorCode error) {
  consecutiveDiscoveryFailures++;
  nextDiscoveryAt = millis() + 100;
  if (consecutiveDiscoveryFailures < DISCOVERY_FAILURE_LIMIT) {
    return;
  }
  autonomousDiscoveryEnabled = false;
  discoveryTargetPending = false;
  discoveryWaitForRemoval = false;
  // Keep network health independent from PN532 health. The controller will
  // reinitialize the radio over this existing WebSocket with bounded backoff.
  const uint8_t status[] = {
      static_cast<uint8_t>(ReaderRuntimeState::FAILED),
      static_cast<uint8_t>(error),
      consecutiveDiscoveryFailures,
  };
  sendProtocolMessage(
      MessageType::READER_STATUS,
      nextReaderStatusRequestId++,
      0,
      status,
      sizeof(status)
  );
}

static void runAutonomousDiscovery() {
  if (!autonomousDiscoveryEnabled || !websocketConnected ||
      otaInProgress || waitingForPn532Response ||
      discoveryFrameLength == 0) {
    return;
  }

  const uint32_t now = millis();
  if (discoveryTargetPending) {
    if (now - discoveryTargetPendingAt <
        DISCOVERY_TARGET_WATCHDOG_MS) {
      return;
    }
    // The controller disappeared or failed to resume after authentication.
    discoveryTargetPending = false;
    discoveryWaitForRemoval = true;
  }
  if (static_cast<int32_t>(now - nextDiscoveryAt) < 0) {
    return;
  }

  static const uint8_t RF_FIELD_OFF[] = {0x01, 0x02};
  static const uint8_t POLL_TYPE_A[] = {0x01, 0x00};
  static const uint8_t DETECTION_RETRIES[] = {
      0x05, 0xFF, 0x01, 0x00
  };
  static const uint8_t RF_TIMEOUTS[] = {0x02, 0x0A, 0x0B, 0x08};
  static const uint8_t BIT_FRAMING[] = {0x63, 0x3D, 0x00};

  ErrorCode error = ErrorCode::PN532_TIMEOUT;
  size_t responseLength = 0;
  auto execute = [&](
      uint8_t command,
      const uint8_t* data,
      uint8_t dataLength,
      uint16_t timeoutMs
  ) {
    responseLength = 0;
    return executeLocalPn532Command(
        command,
        data,
        dataLength,
        timeoutMs,
        pn532AckFrame,
        responseLength,
        error
    );
  };

  if (!execute(0x32, RF_FIELD_OFF, sizeof(RF_FIELD_OFF), 300) ||
      !execute(0x4A, POLL_TYPE_A, sizeof(POLL_TYPE_A), 500)) {
    autonomousDiscoveryFailure(error);
    return;
  }

  if (responseLength > 0 && pn532AckFrame[0] > 0) {
    consecutiveDiscoveryFailures = 0;
    if (discoveryWaitForRemoval) {
      discoveryNoTargetSince = 0;
      nextDiscoveryAt = millis() + DISCOVERY_INTERVAL_MS;
      return;
    }
    if (responseLength + 1 > MAX_PROTOCOL_PAYLOAD) {
      autonomousDiscoveryFailure(ErrorCode::PN532_FRAME_TOO_LARGE);
      return;
    }
    memmove(pn532AckFrame + 1, pn532AckFrame, responseLength);
    pn532AckFrame[0] = 1;
    const uint32_t requestId = nextTargetEventRequestId++;
    sendProtocolMessage(
        MessageType::TARGET_EVENT,
        requestId,
        0,
        pn532AckFrame,
        static_cast<uint16_t>(responseLength + 1)
    );
    discoveryTargetPending = true;
    discoveryTargetPendingAt = millis();
    return;
  }

  if (discoveryWaitForRemoval) {
    if (discoveryNoTargetSince == 0) {
      discoveryNoTargetSince = millis();
    }
    if (millis() - discoveryNoTargetSince <
        DISCOVERY_REMOVAL_CONFIRM_MS) {
      nextDiscoveryAt = millis() + DISCOVERY_INTERVAL_MS;
      return;
    }
    discoveryWaitForRemoval = false;
    discoveryNoTargetSince = 0;
  }
  if (!execute(
          0x32,
          DETECTION_RETRIES,
          sizeof(DETECTION_RETRIES),
          300
      ) ||
      !execute(0x32, RF_TIMEOUTS, sizeof(RF_TIMEOUTS), 300) ||
      !execute(0x08, BIT_FRAMING, sizeof(BIT_FRAMING), 300) ||
      !execute(
          0x42,
          discoveryFrame,
          discoveryFrameLength,
          300
      ) ||
      !execute(0x32, RF_FIELD_OFF, sizeof(RF_FIELD_OFF), 300)) {
    autonomousDiscoveryFailure(error);
    return;
  }
  consecutiveDiscoveryFailures = 0;
  nextDiscoveryAt = millis() + DISCOVERY_INTERVAL_MS;
}

static void handleAccessResult(const ProtocolMessage& message) {
  // Payload: granted (u8), unlock duration (u32 big-endian). The access
  // controller performs the actual door action; this is local feedback only.
  if (message.payloadLength != 5 || message.payload[0] > 1) {
    sendError(message.requestId, ErrorCode::BAD_MESSAGE);
    return;
  }
  lastAccessGranted = message.payload[0] == 1;
  accessFeedbackUntil = millis() + ACCESS_FEEDBACK_DURATION_MS;
  sendProtocolMessage(
      MessageType::RESPONSE, message.requestId, 0, nullptr, 0
  );
}

static void handleButtonResult(const ProtocolMessage& message) {
  if (!buttonPending ||
      message.requestId != buttonRequestId ||
      message.payloadLength != 1 ||
      message.payload[0] > 1) {
    return;
  }
  buttonPending = false;
  lastAccessGranted = message.payload[0] == 1;
  accessFeedbackUntil = millis() + (
      lastAccessGranted
          ? BUTTON_SUCCESS_DURATION_MS
          : BUTTON_FAILURE_DURATION_MS
  );
}

static void handleFirmwareUpdateCheck(const ProtocolMessage& message) {
  if (message.payloadLength != 0) {
    sendError(message.requestId, ErrorCode::BAD_MESSAGE);
    return;
  }
  sendProtocolMessage(
      MessageType::RESPONSE, message.requestId, 0, nullptr, 0
  );
  firmwareCheckRequested = true;
}

static void handleBinaryMessage(uint8_t* payload, size_t length) {
  ProtocolMessage message{};
  if (!decodeMessage(payload, length, message)) {
    sendError(0, ErrorCode::BAD_MESSAGE);
    return;
  }

