SjamonDaal/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
  switch (message.type) {
    case MessageType::EXECUTE:
      handleExecute(message);
      break;
    case MessageType::READ_FRAME:
      handleReadFrame(message);
      break;
    case MessageType::RESET:
      hardwareResetPn532();
      sendProtocolMessage(
          MessageType::RESPONSE, message.requestId, 0, nullptr, 0
      );
      break;
    case MessageType::DISCOVER:
      handleDiscover(message);
      break;
    case MessageType::START_DISCOVERY:
      handleStartDiscovery(message);
      break;
    case MessageType::RESUME_DISCOVERY:
      handleResumeDiscovery(message);
      break;
    case MessageType::TRANSCEIVE:
      handleTransceive(message);
      break;
    case MessageType::ACCESS_RESULT:
      handleAccessResult(message);
      break;
    case MessageType::BUTTON_RESULT:
      handleButtonResult(message);
      break;
    case MessageType::FIRMWARE_UPDATE_CHECK:
      handleFirmwareUpdateCheck(message);
      break;
    default:
      sendError(message.requestId, ErrorCode::UNSUPPORTED_TYPE);
      break;
  }
}

static String normalizedMacAddress() {
  uint8_t mac[6];
  WiFi.macAddress(mac);
  char value[13];
  snprintf(
      value,
      sizeof(value),
      "%02x%02x%02x%02x%02x%02x",
      mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]
  );
  return String(value);
}

static String deriveReaderToken() {
#if defined(ARDUINO_ARCH_ESP32)
  uint8_t digest[32];
  mbedtls_md_hmac(
      mbedtls_md_info_from_type(MBEDTLS_MD_SHA256),
      reinterpret_cast<const uint8_t*>(FLEET_SECRET),
      strlen(FLEET_SECRET),
      reinterpret_cast<const uint8_t*>(readerId.c_str()),
      readerId.length(),
      digest
  );
  char hex[sizeof(digest) * 2 + 1];
  for (size_t i = 0; i < sizeof(digest); i++) {
    snprintf(hex + i * 2, 3, "%02x", digest[i]);
  }
  return String(hex);
#else
  String token = experimental::crypto::SHA256::hmac(
      readerId,
      FLEET_SECRET,
      strlen(FLEET_SECRET),
      experimental::crypto::SHA256::NATURAL_LENGTH
  );
  token.toLowerCase();
  return token;
#endif
}

static void sendHello() {
  String hello = "{\"type\":\"hello\",\"protocol\":1,\"reader_id\":\"";
  hello += readerId;
  hello += "\",\"token\":\"";
  hello += readerToken;
  hello += "\",\"firmware\":\"";
  hello += FIRMWARE_VERSION;
  hello += "\",\"wifi_rssi\":";
  hello += String(WiFi.RSSI());
  hello += ",\"wifi_reconnects\":";
  hello += String(wifiDisconnectCount);
  hello += "}";
  webSocket.sendTXT(hello);
}

static void webSocketEvent(WStype_t type, uint8_t* payload, size_t length) {
  switch (type) {
    case WStype_CONNECTED:
      websocketConnected = true;
      websocketConnectedAt = millis();
      websocketDisconnectedAt = 0;
      cancelAsyncTransceive();
      clearPn532Input();
      sendHello();
      break;
    case WStype_DISCONNECTED:
      if (
          !websocketConnected ||
          millis() - websocketConnectedAt < WS_RECONNECT_STABLE_MS
      ) {
        websocketReconnectDelayMs = min<uint32_t>(
            websocketReconnectDelayMs * 2,
            WS_RECONNECT_MAX_INTERVAL_MS
        );
      } else {
        websocketReconnectDelayMs = WS_RECONNECT_INTERVAL_MS;
      }
      webSocket.setReconnectInterval(websocketReconnectDelayMs);
      websocketConnected = false;
      if (websocketDisconnectedAt == 0) {
        websocketDisconnectedAt = millis();
      }
      cancelAsyncTransceive();
      autonomousDiscoveryEnabled = false;
      discoveryTargetPending = false;
      discoveryWaitForRemoval = false;
      if (buttonPending) {
        buttonPending = false;
        lastAccessGranted = false;
        accessFeedbackUntil =
            millis() + BUTTON_FAILURE_DURATION_MS;
      }
      clearPn532Input();
      break;
    case WStype_BIN:
      handleBinaryMessage(payload, length);
      break;
    default:
      break;
  }
}

static void connectWifiIfNeeded() {
  const uint32_t now = millis();
  if (WiFi.status() == WL_CONNECTED) {
    if (!wifiWasConnected) {
      wifiWasConnected = true;
      wifiConnectedAt = now;
    } else if (
        wifiReconnectDelayMs != WIFI_RETRY_INTERVAL_MS &&
        now - wifiConnectedAt >= WIFI_STABLE_RESET_MS
    ) {
      wifiReconnectDelayMs = WIFI_RETRY_INTERVAL_MS;
    }
    return;
  }

  if (wifiWasConnected) {
    wifiWasConnected = false;
    wifiDisconnectCount++;
    nextWifiAttemptAt = 0;
  }
  if (
      nextWifiAttemptAt != 0 &&
      static_cast<int32_t>(now - nextWifiAttemptAt) < 0
  ) {
    return;
  }

  if (!wifiStarted) {
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    wifiStarted = true;
  } else {
    // Do not call WiFi.disconnect() here: repeatedly tearing down a slow
    // association can keep a marginal reader offline indefinitely.
    WiFi.reconnect();
  }
  nextWifiAttemptAt = now + wifiReconnectDelayMs;
  wifiReconnectDelayMs = min<uint32_t>(
      wifiReconnectDelayMs * 2,
      WIFI_RETRY_MAX_INTERVAL_MS
  );
}

static void recoverStaleWifiPathIfNeeded() {
  if (
      WiFi.status() != WL_CONNECTED ||
      websocketConnected ||
      websocketDisconnectedAt == 0 ||
      millis() - websocketDisconnectedAt < WS_WIFI_RECOVERY_MS
  ) {
    return;
  }
  const uint32_t now = millis();
  if (
      lastWifiPathRecoveryAt != 0 &&
      now - lastWifiPathRecoveryAt < WS_WIFI_RECOVERY_MS
  ) {
    return;
  }

  // Some APs retain an ESP8266 association after its IP data path has become
  // unusable. A single deliberate re-association after a full minute offline
  // forces a new scan/BSSID choice without repeatedly aborting association.
  lastWifiPathRecoveryAt = now;
  wifiDisconnectCount++;
  wifiWasConnected = false;
  wifiReconnectDelayMs = WIFI_RETRY_INTERVAL_MS;
  nextWifiAttemptAt = now + WIFI_RETRY_INTERVAL_MS;
  WiFi.disconnect(false);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
}

static void startOtaIfNeeded() {
  if (otaStarted || WiFi.status() != WL_CONNECTED) {
    return;
  }
  ArduinoOTA.setHostname(deviceHostname.c_str());
  ArduinoOTA.setPassword(readerToken.c_str());
  ArduinoOTA.setRebootOnSuccess(true);
  ArduinoOTA.onStart([]() {
    otaInProgress = true;
    websocketConnected = false;
    cancelAsyncTransceive();
    clearPn532Input();
    webSocket.disconnect();
  });
  ArduinoOTA.onEnd([]() {
    digitalWrite(STATUS_LED_PIN, LOW);
  });
  ArduinoOTA.onError([](ota_error_t) {
    otaInProgress = false;
  });
#if defined(ARDUINO_ARCH_ESP32)
  // arduino-esp32's ArduinoOTA::begin() takes no arguments; mDNS is always
  // advertised.
  ArduinoOTA.begin();
#else
  ArduinoOTA.begin(true);
#endif
  otaStarted = true;
}

static void configureHttpUpdates() {
  FirmwareUpdate.rebootOnUpdate(true);
#if !defined(ARDUINO_ARCH_ESP32)
  // ESP32's HTTPUpdate class exposes neither of these; ESP32 instead sends
  // Basic auth per request via the update() call's requestCB (see
  // checkForFirmwareUpdate) and accepts the class's default client timeout.
  FirmwareUpdate.closeConnectionsOnUpdate(true);
  FirmwareUpdate.setClientTimeout(5000);
  FirmwareUpdate.setAuthorization(readerId, readerToken);
#endif
  FirmwareUpdate.onStart([]() {
    otaInProgress = true;
    websocketConnected = false;
    cancelAsyncTransceive();
    buttonPending = false;
    clearPn532Input();
    webSocket.disconnect();
  });
  FirmwareUpdate.onEnd([]() {
    setStatusLed(false);
  });
  FirmwareUpdate.onError([](int) {
    otaInProgress = false;
  });
}

static void checkForFirmwareUpdate() {
  if (WiFi.status() != WL_CONNECTED || !websocketConnected ||
      otaInProgress || waitingForPn532Response || buttonPending) {
    return;
  }
  const bool requested = firmwareCheckRequested;
  firmwareCheckRequested = false;
  firmwareFirstCheckCompleted = true;
  lastFirmwareCheckAt = millis();

