SjamonDaal/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
  // A normal 304 check must not interrupt reader service. The updater's
  // onStart callback disconnects only when a real image will be installed.
  WiFiClient client;
#if defined(ARDUINO_ARCH_ESP32)
  const HTTPUpdateResult result = FirmwareUpdate.update(
      client,
      BACKEND_HOST,
      FIRMWARE_API_PORT,
      FIRMWARE_UPDATE_PATH,
      FIRMWARE_VERSION,
      [](HTTPClient* http) {
        http->setAuthorization(readerId.c_str(), readerToken.c_str());
      }
  );
#else
  const HTTPUpdateResult result = FirmwareUpdate.update(
      client,
      BACKEND_HOST,
      FIRMWARE_API_PORT,
      FIRMWARE_UPDATE_PATH,
      FIRMWARE_VERSION
  );
#endif
  if (result == HTTP_UPDATE_FAILED && requested) {
    lastAccessGranted = false;
    accessFeedbackUntil = millis() + BUTTON_FAILURE_DURATION_MS;
  }
}

static void checkFirmwareUpdateIfDue() {
  const uint32_t now = millis();
  const bool requested = firmwareCheckRequested;
  const bool initial = (
      !firmwareFirstCheckCompleted &&
      now >= FIRMWARE_INITIAL_CHECK_DELAY_MS
  );
  const bool periodic = (
      firmwareFirstCheckCompleted &&
      now - lastFirmwareCheckAt >= FIRMWARE_CHECK_INTERVAL_MS
  );
  if (requested || initial || periodic) {
    checkForFirmwareUpdate();
  }
}

static void updateButton() {
  const uint32_t now = millis();
  const bool pressed = digitalRead(BUTTON_PIN) == LOW;
  if (pressed != buttonRawPressed) {
    buttonRawPressed = pressed;
    buttonChangedAt = now;
  }
  if (now - buttonChangedAt >= BUTTON_DEBOUNCE_MS &&
      buttonStablePressed != buttonRawPressed) {
    buttonStablePressed = buttonRawPressed;
    if (buttonStablePressed && !buttonPending) {
      if (!websocketConnected) {
        lastAccessGranted = false;
        accessFeedbackUntil =
            now + BUTTON_FAILURE_DURATION_MS;
      } else {
        buttonRequestId = nextButtonRequestId++;
        if (nextButtonRequestId == 0) {
          nextButtonRequestId = 0x80000000;
        }
        buttonPending = true;
        buttonSentAt = now;
        sendProtocolMessage(
            MessageType::BUTTON_EVENT,
            buttonRequestId,
            0,
            nullptr,
            0
        );
      }
    }
  }
  if (buttonPending &&
      now - buttonSentAt >= BUTTON_RESULT_TIMEOUT_MS) {
    buttonPending = false;
    lastAccessGranted = false;
    accessFeedbackUntil = now + BUTTON_FAILURE_DURATION_MS;
  }
}

static void setStatusLed(bool on) {
  digitalWrite(STATUS_LED_PIN, on ? HIGH : LOW);
}

static void setNetworkLed(bool on) {
#if defined(ARDUINO_ARCH_ESP32)
  digitalWrite(NETWORK_LED_PIN, on ? HIGH : LOW);
#else
  // The NodeMCU built-in LED is active low.
  digitalWrite(NETWORK_LED_PIN, on ? LOW : HIGH);
#endif
}

static void updateNetworkLed() {
  const uint32_t now = millis();
  if (otaInProgress) {
    // Very rapid blink while flash is being written.
    setNetworkLed((now / 80) % 2);
    return;
  }
  if (WiFi.status() != WL_CONNECTED) {
    // Fast blink: associating with Wi-Fi.
    setNetworkLed((now / 200) % 2);
    return;
  }
  if (!websocketConnected) {
    // Slow blink: Wi-Fi is up, controller connection is not.
    setNetworkLed((now / 600) % 2);
    return;
  }
  if (!autonomousDiscoveryEnabled) {
    // Double pulse: controller is connected but PN532 is initializing or
    // waiting for its bounded recovery cycle.
    const uint32_t phase = now % 2000;
    setNetworkLed(phase < 120 || (phase >= 240 && phase < 360));
    return;
  }
  // Solid: Wi-Fi, controller WebSocket, and PN532 discovery are ready.
  setNetworkLed(true);
}

static void updateStatusLed() {
  if (otaInProgress) {
    setStatusLed((millis() / 50) % 2);
    return;
  }
  if (buttonPending) {
    setStatusLed(true);
    return;
  }
  if (static_cast<int32_t>(accessFeedbackUntil - millis()) > 0) {
    // Success holds the LED on; failure uses a rapid attention pattern.
    setStatusLed(
        lastAccessGranted || ((millis() / 70) % 2)
    );
    return;
  }
  if (WiFi.status() != WL_CONNECTED) {
    setStatusLed((millis() / 250) % 2);
  } else if (websocketConnected) {
    setStatusLed(false);
  } else {
    setStatusLed(millis() % 2000 < 100);
  }
}

void setup() {
#if defined(ARDUINO_ARCH_ESP32)
  // Set the off level (active-high LED, so LOW) before enabling output.
  digitalWrite(NETWORK_LED_PIN, LOW);
#else
  // GPIO2/D4 is a boot strap pin. Keep it high while changing it to output;
  // the on-board LED is therefore off until firmware is fully running.
  digitalWrite(NETWORK_LED_PIN, HIGH);
#endif
  pinMode(NETWORK_LED_PIN, OUTPUT);
  setNetworkLed(false);
  pinMode(STATUS_LED_PIN, OUTPUT);
  setStatusLed(false);
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  // Set the inactive level before changing the pin to output, avoiding an
  // unintended reset pulse during GPIO initialization.
  digitalWrite(PN532_RESET_PIN, HIGH);
  pinMode(PN532_RESET_PIN, OUTPUT);
  buttonRawPressed = digitalRead(BUTTON_PIN) == LOW;
  buttonStablePressed = buttonRawPressed;

  PN532_SERIAL.setRxBufferSize(PN532_RING_SIZE);
#if defined(ARDUINO_ARCH_ESP32)
  PN532_SERIAL.begin(
      PN532_BAUD_RATE, SERIAL_8N1, PN532_RX_PIN, PN532_TX_PIN
  );
#else
  PN532_SERIAL.begin(PN532_BAUD_RATE, SERIAL_8N1);
#endif
  PN532_SERIAL.setTimeout(2);
  hardwareResetPn532();

  WiFi.persistent(false);
  WiFi.mode(WIFI_STA);
#if defined(ARDUINO_ARCH_ESP32)
  WiFi.setSleep(false);
#else
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
#endif
  WiFi.setAutoReconnect(true);

  readerId = normalizedMacAddress();
  readerToken = deriveReaderToken();
  deviceHostname = "TDS-Door-Access-V2-" + readerId;
  configureHttpUpdates();
#if defined(ARDUINO_ARCH_ESP32)
  WiFi.setHostname(deviceHostname.c_str());
#else
  WiFi.hostname(deviceHostname);
#endif
  connectWifiIfNeeded();

  webSocket.begin(BACKEND_HOST, BACKEND_PORT, BACKEND_PATH);
  webSocket.onEvent(webSocketEvent);
  webSocket.setReconnectInterval(WS_RECONNECT_INTERVAL_MS);
  webSocket.enableHeartbeat(
      WS_HEARTBEAT_INTERVAL_MS,
      WS_HEARTBEAT_TIMEOUT_MS,
      WS_HEARTBEAT_MISSES
  );
}

void loop() {
  connectWifiIfNeeded();
  startOtaIfNeeded();
  if (otaStarted) {
    ArduinoOTA.handle();
  }
  if (otaInProgress) {
    updateStatusLed();
    updateNetworkLed();
    yield();
    return;
  }
  webSocket.loop();
  recoverStaleWifiPathIfNeeded();
  if (
      websocketConnected &&
      websocketReconnectDelayMs != WS_RECONNECT_INTERVAL_MS &&
      millis() - websocketConnectedAt >= WS_RECONNECT_STABLE_MS
  ) {
    websocketReconnectDelayMs = WS_RECONNECT_INTERVAL_MS;
    webSocket.setReconnectInterval(websocketReconnectDelayMs);
  }
  updateButton();
  drainPn532Uart();
  updateAsyncTransceive();
  runAutonomousDiscovery();
  updateStatusLed();
  updateNetworkLed();
  checkFirmwareUpdateIfDue();

#if SERIAL_DIAGNOSTICS
  // ESP8266: PN532 and this diagnostic output share the sole hardware UART,
  // so PN532 TX/RX must be disconnected while using this build. ESP32: PN532
  // uses a dedicated UART2, so this output is available over USB (UART0)
  // with the reader connected as normal.
  static uint32_t lastStatusAt = 0;
  if (millis() - lastStatusAt >= 2000) {
    lastStatusAt = millis();
    Serial.printf(
        "[bridge] id=%s host=%s wifi=%s ip=%s websocket=%s ota=%s\n",
        readerId.c_str(),
        deviceHostname.c_str(),
        WiFi.status() == WL_CONNECTED ? "connected" : "connecting",
        WiFi.localIP().toString().c_str(),
        websocketConnected ? "connected" : "connecting",
        otaStarted ? "ready" : "starting"
    );
  }
#endif

  yield();
}
